---
type: ViewExportingEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# ViewExportingEventArgs

`Autodesk.Revit.DB.Events.ViewExportingEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ViewId | 2018 | `public ElementId ViewId { get ; }` |